Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P29B.tmx
Source language: en_us
Languages: zh_cn

source: "People shouldn't spread stories," she said.
zh_cn: “人们不应该传布捕风作影的事，” 她说。

source: "Not unless they know all the facts."
zh_cn: “除非他们了解全部事实的真相。”

source: The facts, it turned out, were fairly straightforward.
zh_cn: 后来事实证明，其实事情再简单不过了。

source: Bobby Curran had been drinking in the White Swan when Des Cronin and his brothers came by.
zh_cn: 鲍比柯伦在白天鹅酒吧喝酒时，正赶上德克罗宁和他的几个兄弟从旁路过。

source: There had been bad blood between Des and Bobby since they'd got into a drunken argument about a motorcycle at Dave Mooney's Christmas party.
zh_cn: 一次德和鲍比在戴夫．穆尼的圣诞晚会喝醉酒后因一辆摩托车而争斗起来，自那以后两人便结下冤仇。

source: Everybody knew the affair wasn't over, but nothing happened until that night in the Swan, six months later, when Des and his brothers found Bobby alone and half-cut in a place where he hardly ever drank.
zh_cn: 谁都知道这事并没有结束，可是半年过去了，什么事也没有发生，直到那天晚上在白天鹅酒吧，德和他的兄弟发现鲍比孤身一人喝得酩酊大醉，而且他之前几乎从不到这来喝酒。

source: The Cronins were too scared of Bobby to have a square go with him; even that night, when it was three against one, they didn't do anything right away, because none of them were carrying.
zh_cn: 克罗宁哥仨都对鲍比心存畏惧，没有一个人敢一对一与他交手，虽然那天晚上，是对一三，他们也没有马上动手，因为他们都没有随身携带家伙。

source: They couldn't have fought it out with fists and boots, like in the old days-they had to be armed.
zh_cn: 他们不能像古时那样靠拳打脚踢来和人打架，他们必须得有家伙什。

source: Since Des lived right across the road, all that was needed was someone to keep an eye on Bobby so he didn't leave while the Cronins ran back to Des's flat for some blades.
zh_cn: 由于德就住在马路对面，所以现在关键是需要有人密切监视鲍比，别让他走掉，好让克罗宁兄弟趁机跑回德家取几把刀来。

source: Stan was the one who kept Bobby talking while the boys got themselves ready.
zh_cn: 在几个男孩做准备时一直缠着鲍比跟他说的那个人就是斯坦。

source: Then, when Bobby went out back to the toilets, he gave the Cronins the signal and they went in.
zh_cn: 然后，鲍比出去上厕所，他给克罗宁兄弟发了信号，他们便冲了进去。

source: It was over in seconds: Bobby probably didn't even know what hit him.
zh_cn: 整个过程只有几秒钟时间：鲍比可能甚至不知道什么东西击中了他。

source: The Cronins ran out, their clothes covered in blood, but nobody tried to stop them.
zh_cn: 克罗宁兄弟跑了出去，他们的衣服沾满血迹，但没有一个人试图阻止他们。

source: Jim the Landlord came around the bar and went out the back to see what had happened, and he did first aid on Bobby while somebody called the police and most of his custom melted away, not wanting to be there when the law arrived.
zh_cn: 酒吧老板吉姆绕过吧台，走到后去看看发生了什么事，他对鲍比进行了急救，同时有人打电话报警，当然他的绝大多数客人逗留走了，他们不想呆在那里等着警察到来。
